#!/usr/bin/env ruby
# coding: utf-8

require 'mongo'

Encoding.default_external = Encoding::UTF_8

def Main()

	puts '### start ###'



	# =========================================================================
	# 接続
	# =========================================================================
	client = Mongo::Client.new(['127.0.0.1:27017'], :database => 'test')



	# =========================================================================
	# データ登録
	# =========================================================================

	# 特定のコレクション(ツリー)を参照
	collection = client['sakaguradb']
	
	# 特定の属性にインデックスを作成する
	client['sakaguradb'].indexes.create_one({ '会社名' => 1 }, :unique => true)

	# 特定条件で削除
	# collection.find({'会社名' => '*'}).delete_many
	collection.find({}).delete_many



	# =========================================================================
	# データ登録
	# =========================================================================

	collection.insert_one({
		'会社名' => '那賀酒造有限会社',
		'住所' => '徳島県那賀郡那賀町和食字町35',
		'電話' => '0884-62-2003',
		'銘柄' => ['旭若松 純米 無濾過生原酒 山田錦',
					'旭若松 純米 無濾過生原酒 雄町']
	})

	collection.insert_one({
		'会社名' => '株式会社せんきん',
		'郵便番号' => '',
		'住所' => '栃木県さくら市',
		'電話' => '',
		'銘柄' => ['仙禽　亀の尾５５　純米吟醸　中取り　無濾過原酒',
					'仙禽　木桶仕込　山廃純米　無濾過原酒　愛山米　磨き８０％',
					'仙禽　生もと純米吟醸　無濾過原酒　雄町米　磨き５５％',
					'仙禽　純米吟醸　中取り　無濾過原酒　八反錦米　磨き５５％']
	})

	collection.insert_one({
		'会社名' => '宗玄酒造株式会社',
		'郵便番号' => '',
		'住所' => '石川県珠洲市宝立町宗玄24－22',
		'電話' => '0768－84－1314',
		'銘柄' => ['宗玄 純米生原酒 山田錦']
	})

	collection.insert_one({
		'会社名' => '合名会社森喜酒造場',
		'郵便番号' => '',
		'住所' => '三重県伊賀市千歳４１番地の２',
		'電話' => '０５９５－２３－３０４０',
		'メールアドレス' => 'fwkc6398@mb.infoweb.ne.jp',
		'銘柄' => ['すっぴんるみ子の酒',
					'るみ子の酒特別純米にごり生原酒'],
	})

	collection.insert_one({
		'会社名' => '川西屋酒造店',
		'郵便番号' => '',
		'住所' => '神奈川県足柄上郡山北町山北２５０',
		'電話' => '',
		'メールアドレス' => '',
		'銘柄' => ['隆　播州山田錦純米大吟醸生　山吹　２０１４年【新酒・限定酒】',
					'隆　播州山田錦純米大吟醸無濾過生原酒　山吹　２０１４年【新酒・超限定酒】',
					'隆　播州山田錦純米吟醸生原酒　水色　２０１３年【超限定酒】'],
		'創業' => '１８９７年（明治３０年）'
	})

	collection.insert_one({
		'会社名' => '山忠本家酒造株式会社',
		'住所' => '愛知県愛西市佐屋町日置１８１３',
		'銘柄' => ['義侠　純米生原酒　１５００ｋｇ　６０％　特別栽培米　Ｈ２６ＢＹ'],
	})

	collection.insert_one({
		'会社名' => '株式会社豊島屋',
		'郵便番号' => '394-0028',
		'住所' => '長野県岡谷市本町3-9-1',
		'電話' => '',
		'メールアドレス' => '',
		'銘柄' => ['神渡　純米生酒　極寒しぼり　氷湖の雫'],
		'創業' => '',
	})

	collection.insert_one({
		'会社名' => '長珍酒造株式会社',
		'住所' => '愛知県津島市本町３丁目６２番地',
		'銘柄' => ['長珍「純米大吟醸」禄（ろく）',
					'長珍「特別純米」にごり原酒本生辛口',
					'長珍「純米大吟醸」しんぶんし４０ 無濾過生',
					'長珍「純米吟醸」しんぶんし５０ 無濾過生',
					'長珍「純米吟醸」備前雄町無濾過生',
					'長珍「純米」しんぶんし６０ 無濾過生',
					'長珍「純米吟醸」山山５０５５うすにごり']
	})

	puts collection.find({}).count

	puts '--- end ---'

end

Main()
